/*
# C1. 별 찍기 (정사각형)

숫자를 하나 입력받은 후에 이 숫자만큼의 크기를 갖는 정사각형을 '#' 문자로 화면에 출력하라. 예를 들어 10을 입력하면 10개의 '#' 문자가 들어있는 라인 10개를 출력하는 것이다.

변수는 다음과 같이 사용하라.

``` 
int length; // 입력받은 정사각형 한 변의 길이 
int i, j; // 반복문 사용을 위한 변수 
```
출력 예)

```
정사각형의 크기를 입력하시오. 10
##########
##########
##########
##########
##########
##########
##########
##########
##########
##########
```

```
정사각형의 크기를 입력하시오. 20
####################
####################
####################
####################
####################
####################
####################
####################
####################
####################
####################
####################
####################
####################
####################
####################
####################
####################
####################
####################
```
*/
#include <stdio.h>

int main(void) {
  int length; // 입력받은 정사각형 한 변의 길이
  int i, j;   // 반복문 사용을 위한 변수

  printf("정사각형의 크기를 입력하시오. ");
  scanf("%d", &length);

  for (i = 0; i < length; i++) {
    for (j = 0; j < length; j++) {
      printf("#");
    }
    printf("\n");
  }

  return 0;
}